// 1. 본인이름학번의 네임스페이스
// -본인이름학번 네임스페이스 예: 이름이 김프로이고 학번이 3727500일 경우 KimPro3727500
// using 지시자는 cpp파일에서는 영역 { block } 안에서 사용, 헤더파일엔 using 지시자는 사용하지 않고 네임스페이스 지정자를 사용합니다.
// -using 지시자 예: { using namespace std; cout << "Enter your id: "; }
// -네임스페이스 지정자 예: std::cout << "Enter your id: ";

// 2. 클래스1.h: 클래스1 정의
// 1의 본인이름학번의 네임스페이스 안에 클래스1을 정의하고 멤버함수들도 모두 인라인으로 구현합니다. 
// private 멤버변수 선언 (2개 이상)
// private 멤버함수 정의
// -test멤버변수1: 멤버변수1 범위가 아니면 프로그램 종료
// -test멤버변수2: 멤버변수2 범위가 아니면 프로그램 종료
// public 멤버함수 정의
// -생성자: 모든 멤버변수 초기화, 기본값 설정, test함수들 호출
// -input: 표준스트림입력으로 멤버변수들 입력, test함수들 호출
// -set 접근함수들: 멤버변수 값 설정 및 test함수 호출
// -print: 표준스트림출력으로 멤버변수들 출력
// -get 접근함수들: 멤버변수 값 리턴
// -멤버함수로 전위증가연산자, 후위증가연산자 정의
// -프렌드함수로서 입력연산자 >>, 출력연산자 <<, 이항연산자 ==, 이항연산자 + 정의

// 3. 클래스2.h: 클래스2 정의
// 1의 본인이름학번의 네임스페이스 안에 클래스2를 정의하고 멤버함수들도 모두 인라인으로 구현합니다. 
// private 멤버변수 선언: 클래스1형 객체, 그 외 멤버변수 1개 이상
// public 멤버함수 인라인으로 정의
// -생성자: 모든 멤버변수 초기화, 기본값 설정
// -print: 표준스트림출력으로 멤버변수들 출력
// -클래스1형 객체의 접근함수를 참조형식으로 구현

// 3. main.cpp: 테스트
// 클래스1형 객체 2개를 선언하고 입력연산자를 이용해서 표준스트림으로 입력, 출력연산자를 이용해서 표준스트림으로 출력
// 두번째 객체에 전위증가연산자 적용한 것을 표준스트림으로 출력
// 두번째 객체에 후위증가연산자 적용한 것을 표준스트림으로 출력
// 두번째 객체를 표준스트림으로 출력
// 두 객체를 비교연산자를 이용하여 비교하여 true면 same, 그렇지 않으면 different를 콘솔창에 출력
// 두 객체를 +이항연산자를 이용하여 더한 값을 표준스트림으로 출력
#include "book.h"
#include "bookStore.h"
int main()
{
    using namespace jangseoyeon2649035;
        book b1, b2;
        std::cout <<"book1: \n";
        std::cin >>b1;
        std::cout <<b1;
        std::cout <<"book2: \n";
        std::cin >>b2;
        std::cout <<b2;

        std::cout<<++b2;
        std::cout <<b2++;
        std::cout << b2;
        
        if(b1==b2) std::cout <<"same\n";
        else std::cout << "different\n";

        std::cout <<(b1+b2) <<std::endl;
    return 0;
}